# GIT - распределенная система контроля версии 
# это система для отслеживания и ведения истории изменения файлом в вашем проекте


# Репозиторий - это хранилища вашего кода и истории его изменений

# GITHub - веб сайт для размещения гид репозиторий и совместной разработки проектов .




# Команды GIT 
# 1. git init -она создает новый гит репозиторий локально на вашем компьютере.

# 2. git commit - как только мы достигаем определенного в разработке  то тогда мы сохраняем и коментируем изменения.(фиксация изменений в репозиторий )
# git commit -m '<coment>'

# 3. git add - когда мы создаем или изменяем файлы то при помощи этой команды мы загружаем все изменения в локальное хранилище (репозиторий)
# git add <названия файла> 
# git add .

# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием (репо в гитхаб)


# fit remote add <название подключения > <сылка на репозиторий>
# git remote add origin <url>

# 5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиториий

# git push <названия нашей ветки>  










